tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "dart-lang/dart"


# Kubernetes package manager
brew "helm"
# Dart - client-optimized language for fast apps on any platform
brew "dart"
#Terminal file manager
brew "lf"
#Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Sound clear in online meetings
cask "krisp"
# Java-based project management
brew "maven"
# Development kit for the Java programming language
brew "openjdk"
# Improved top (interactive process viewer)
brew "htop"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
#GNU Pretty Good Privacy (PGP) package GPG2
brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Internet file retriever
brew "wget"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# General-purpose scripting language
brew "php"
# Open source relational database management system client
brew "mysql-client"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Application launcher and productivity software
cask "alfred"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
brew "notion"
# Desktop sync client for Nextcloud software products
brew "nextcloud"
# Collaboration platform for API development
brew "postman"
# Run a Kubernetes cluster locally
brew "minikube"
# NCurses Disk Usage
brew "ncdu"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Music streaming service
cask "spotify"
# JetBrains tools manager
cask "jetbrains-toolbox"
# System monitoring app
cask "istat-menus"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Password manager app
cask "keepassxc"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Open client for Cisco AnyConnect VPN
cask "openconnect"
# Graphical client for Git version control
cask "sourcetree"
# Tools to protect your emails and files
cask "gpg-suite"
# Email client focusing on privacy protection
cask "postbox"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Web browser
cask "firefox"
# Server and cloud storage browser
cask "cyberduck"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
#File system integration 
cask "macfuse"
# Screenshot software
cask "flameshot"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Memory training application
cask "anki"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Menu bar icon organizer
cask "bartender"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Tools for the WireGuard secure network tunnel
cask "wireguard-tools"
# Productivity app. Drag files to share easily
cask "dropzone"
# Customize mouse behavior
cask "linearmouse"
# Allows switching between application windows
cask "contexts"
# Rust-based terminal
cask "warp"
# GUI for streamlined Redis application development
cask "redisinsight"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Find shortcuts for any installed application
cask "keyclu"
