tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# GNU grep, egrep and fgrep
brew "grep"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Sound clear in online meetings
cask "krisp"
# Java-based project management
brew "maven"
#Development kit for the Java programming language
brew "openjdk"
# Improved top (interactive process viewer)
brew "htop"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
#GNU Pretty Good Privacy (PGP) package GPG2
brew "gnupg"
# Internet file retriever
brew "wget"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Application launcher and productivity software
cask "alfred"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# UNIX shell (command interpreter)
brew "zsh"
# App to write, plan, collaborate, and get organized
brew "notion"
# Desktop sync client for Nextcloud software products
brew "nextcloud"
# Collaboration platform for API development
brew "postman"
# Music streaming service
cask "spotify"
# JetBrains tools manager
cask "jetbrains-toolbox"
# System monitoring app
cask "istat-menus"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Password manager app
cask "keepassxc"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"